# __Ayudantía 3 - Tidy Data__

In [2]:
import pandas as pd

## __📝 Apuntes Importantes__

__(Extraídos desde el _starter pack_)__

### __1) Lectura de XLSXs__
_(3-Resumen Pandas; Cap 1.3 (B))_

In [ ]:
# pip install openpyxl xlrd

Requirement already satisfied: openpyxl in c:\users\gabri\onedrive\python-projects\clases\data visualization\.venv\lib\site-packages (3.1.5)
Collecting xlrd
  Downloading xlrd-2.0.1-py2.py3-none-any.whl.metadata (3.4 kB)
Requirement already satisfied: et-xmlfile in c:\users\gabri\onedrive\python-projects\clases\data visualization\.venv\lib\site-packages (from openpyxl) (2.0.0)
Downloading xlrd-2.0.1-py2.py3-none-any.whl (96 kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1
Note: you may need to restart the kernel to use updated packages.

In [ ]:
# Leer un archivo Excel
df = pd.read_excel('output.xlsx', index_col='Unnamed: 0', sheet_name=0)
df

- Parámetros de utilidad: 
    - ```sep=;``` : Para cambiar el separador (muy útil para algunos csv en español)
    - ```index_col='col1'``` : Indicar si existe una columna indice (por defecto se crea una)
    - ```header=2``` : Indicar la fila donde están los títulos (por defecto es la primera / se puede agregar None para indicar que no tiene)
    - ```usecols=[col1, col2, ...]``` : Especificar columnas de entrada (en caso de excel puede utilizarse según las columnas de excel, por ejemplo 'A:D')
    - ```nrows=1000``` : Especificar cantidad de filas de entrada
    - ```sheet_name='hoja1'``` : Especifica la hoja a leerse (Puede indicarse por nombre, por índice o una lista d ehojas)
    - ```skiprows=2``` : Indica una cantidad de filas para saltar (Si es que no contienen info útil)

### __2) Uniendo DataFrames__
_(3-Resumen Pandas; Cap 4)_

#### __2.1- Concatenación__

La concatenación refiere a la acción de insertar los datos bruzcamente sobre, bajo o al lado de una tabla desde otra.

In [2]:
# data de ejemplo 1
df1 = pd.DataFrame({'Nombre':['Alonso','Esteban','Pablo','Rodrigo'],'Ingreso':[1200,300,1500,600]})
df1

    Nombre  Ingreso
0   Alonso     1200
1  Esteban      300
2    Pablo     1500
3  Rodrigo      600

In [3]:
# data de ejemplo 2
df2 = pd.DataFrame({'Nombre':['Alonso','Esteban','Pablo','Rodrigo','Patricio'],'Ciudad':['San Pedro','Concepción','Concepción','Talcahuano','San Pedro']})
df2

     Nombre      Ciudad
0    Alonso   San Pedro
1   Esteban  Concepción
2     Pablo  Concepción
3   Rodrigo  Talcahuano
4  Patricio   San Pedro

In [4]:
pd.concat([df1, df2]) # pone uno sobbajore el otro y no agrega datos si la columna no existe

     Nombre  Ingreso      Ciudad
0    Alonso   1200.0         NaN
1   Esteban    300.0         NaN
2     Pablo   1500.0         NaN
3   Rodrigo    600.0         NaN
0    Alonso      NaN   San Pedro
1   Esteban      NaN  Concepción
2     Pablo      NaN  Concepción
3   Rodrigo      NaN  Talcahuano
4  Patricio      NaN   San Pedro

In [9]:
pd.concat([df1, df2], axis=1) # Al cambiar el eje, agrega de manera bruzca una tabla al lado de la otra

    Nombre  Ingreso    Nombre      Ciudad
0   Alonso   1200.0    Alonso   San Pedro
1  Esteban    300.0   Esteban  Concepción
2    Pablo   1500.0     Pablo  Concepción
3  Rodrigo    600.0   Rodrigo  Talcahuano
4      NaN      NaN  Patricio   San Pedro

#### __2.2- Fusión__

El `merge` es una fusión compleja y más intelgente que une las tablas a partir de cierta(s) columna(s) en común y por algún método de unión.

In [7]:
# Unir DataFrames por una columna
df_merged = pd.merge(df1, df2, on='Nombre', how='outer') # tiene parametros: on='columna' y how='inner' | 'outer' | 'left' | 'right' | 'cross'
df_merged # Los une en un mismo dataframe

     Nombre  Ingreso      Ciudad
0    Alonso   1200.0   San Pedro
1   Esteban    300.0  Concepción
2     Pablo   1500.0  Concepción
3  Patricio      NaN   San Pedro
4   Rodrigo    600.0  Talcahuano

### __3) Tidy Data__
_(3-Resumen Pandas; Cap 5)_

En este formato, los datos siguen tres principios clave:
1. **Cada variable se almacena en una columna**: Cada atributo o característica de los datos es una columna diferente. Por ejemplo, si estás trabajando con un conjunto de datos sobre ventas, podrías tener columnas como "Producto", "Fecha", "Cantidad", "Precio", etc.
2. **Cada observación está en una fila**: Cada fila representa una única observación o entrada. Por ejemplo, una fila podría representar una transacción o una venta específica de un producto en un día determinado.
3. **Cada tipo de unidad de observación tiene su propio archivo o tabla**: Si tienes múltiples tipos de datos relacionados (como datos de clientes y datos de ventas), cada tipo de entidad se almacena en su propio conjunto de datos. Por ejemplo, podrías tener una tabla para clientes y otra para ventas.

Veamos un ejemplo:

In [8]:
data = {
    'Estudiante': ['Ana', 'Luis', 'María'],
    'Matemáticas_2021': [85, 78, 92],
    'Historia_2021': [88, 74, 85],
    'Ciencias_2021': [90, 80, 88],
    'Matemáticas_2022': [89, 82, 95],
    'Historia_2022': [90, 77, 91],
    'Ciencias_2022': [92, 84, 94],
}

df_no_tidy = pd.DataFrame(data)
df_no_tidy

,Estudiante,Matemáticas_2021,Historia_2021,Ciencias_2021,Matemáticas_2022,Historia_2022,Ciencias_2022
0,Ana,85,88,90,89,90,92
1,Luis,78,74,80,82,77,84
2,María,92,85,88,95,91,94

- Estos datos no cumplen con las condiciones de un formato tidy, por lo que para un mejor manejo deberá ser modificada la tabla.

### __5.1- Función Melt__

La función `melt` permite traspasar una tabla de formato desordenado a uno _tidy_ de manera sencilla indicando cuáles son la variable de observación, como se llamará la nueva variable y qué valor se medirá.

In [9]:
# Reordenandolo: MELT
df_tidy = df_no_tidy.melt(id_vars=['Estudiante'], var_name='Asignatura', value_name='nota')
df_tidy

   Estudiante        Asignatura  nota
0         Ana  Matemáticas_2021    85
1        Luis  Matemáticas_2021    78
2       María  Matemáticas_2021    92
3         Ana     Historia_2021    88
4        Luis     Historia_2021    74
5       María     Historia_2021    85
6         Ana     Ciencias_2021    90
7        Luis     Ciencias_2021    80
8       María     Ciencias_2021    88
9         Ana  Matemáticas_2022    89
10       Luis  Matemáticas_2022    82
11      María  Matemáticas_2022    95
12        Ana     Historia_2022    90
13       Luis     Historia_2022    77
14      María     Historia_2022    91
15        Ana     Ciencias_2022    92
16       Luis     Ciencias_2022    84
17      María     Ciencias_2022    94

In [10]:
# más bonito 
df_tidy2 = df_tidy.copy()
df_tidy2[['Asignatura', 'Año']] = df_tidy['Asignatura'].str.split('_', expand=True) # parametro expand permite dividirse en columnas
df_tidy2 = df_tidy2[['Estudiante','Año','Asignatura','nota']] # Nuevo órden
df_tidy2 = df_tidy2.rename(columns={'nota': 'Nota'}) # Nuevo nombre
df_tidy2

   Estudiante   Año   Asignatura  Nota
0         Ana  2021  Matemáticas    85
1        Luis  2021  Matemáticas    78
2       María  2021  Matemáticas    92
3         Ana  2021     Historia    88
4        Luis  2021     Historia    74
5       María  2021     Historia    85
6         Ana  2021     Ciencias    90
7        Luis  2021     Ciencias    80
8       María  2021     Ciencias    88
9         Ana  2022  Matemáticas    89
10       Luis  2022  Matemáticas    82
11      María  2022  Matemáticas    95
12        Ana  2022     Historia    90
13       Luis  2022     Historia    77
14      María  2022     Historia    91
15        Ana  2022     Ciencias    92
16       Luis  2022     Ciencias    84
17      María  2022     Ciencias    94

### __5.2- Función Pivot__

Función contraria al `melt`.

In [11]:
# Proceso contrario: PIVOT
df_no_tidy = df_tidy.pivot(index='Estudiante',columns=['Asignatura'],values='nota').reset_index()
df_no_tidy

Asignatura,Estudiante,Ciencias_2021,Ciencias_2022,Historia_2021,Historia_2022,Matemáticas_2021,Matemáticas_2022
0,Ana,90,92,88,90,85,89
1,Luis,80,84,74,77,78,82
2,María,88,94,85,91,92,95

## __Workshop 2__:

### Estadísticas reportadas por el Banco Mundial por país
- **PIB Per Cápita**: [https://data.worldbank.org/indicator/NY.GDP.PCAP.CD](https://data.worldbank.org/indicator/NY.GDP.PCAP.CD)
- **Población**: [https://data.worldbank.org/indicator/SP.POP.TOTL](https://data.worldbank.org/indicator/SP.POP.TOTL)
- **Índice de Gini**: [https://data.worldbank.org/indicator/SI.POV.GINI](https://data.worldbank.org/indicator/SI.POV.GINI)

### __Actividades__

##### 1. Descargue los archivos generados por el Banco Mundial en formato Excel. Luego, abra los archivos usando `read_excel()` y especificando que la primera fila corresponda a la que contenga el nombre de las variables. Use el parámetro `header`.

In [3]:
# SOLUCIÓN 1
# Leyendo Rutas
path_route = 'data/ws2/'
file_pib = path_route + 'API_NY.GDP.PCAP.CD_DS2_en_excel_v2_77.xls'
file_gini = path_route + 'API_SI.POV.GINI_DS2_en_excel_v2_167.xls'
file_pop = path_route + 'API_SP.POP.TOTL_DS2_en_excel_v2_164.xls'

# -> Tambien se puede usar glob('data/ws2/*.xls'), pero quería mostrar una alternativa simple

df_pib = pd.read_excel(file_pib,
                       header=3)
df_gini = pd.read_excel(file_gini,
                       header=3)
df_pop = pd.read_excel(file_pop,
                       header=3)

In [4]:
df_pib.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
0,Aruba,ABW,GDP per capita (current US$),NY.GDP.PCAP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,27458.225331,27441.529662,28440.051964,30082.127645,31096.205074,22855.932320,27200.061079,30559.533535,33984.790620,NaN
1,Africa Eastern and Southern,AFE,GDP per capita (current US$),NY.GDP.PCAP.CD,186.132432,186.947182,197.408105,225.447007,209.005786,226.883067,...,1479.564123,1329.777824,1520.171298,1538.924188,1493.780445,1344.080962,1522.590088,1628.024526,1659.515290,NaN
2,Afghanistan,AFG,GDP per capita (current US$),NY.GDP.PCAP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,565.569730,522.082216,525.469771,491.337221,496.602504,510.787063,356.496214,357.261153,415.707417,NaN
3,Africa Western and Central,AFW,GDP per capita (current US$),NY.GDP.PCAP.CD,121.938353,127.452629,133.825452,139.006714,148.547736,155.563837,...,1845.767804,1616.843198,1560.162999,1703.896392,1783.654365,1664.249176,1747.840549,1777.235012,1568.724310,NaN
4,Angola,AGO,GDP per capita (current US$),NY.GDP.PCAP.CD,NaN,NaN,NaN,NaN,NaN,NaN,...,3213.902611,1807.952941,2437.259712,2538.591391,2189.855714,1449.922867,1925.874661,2929.694455,2308.159767,NaN

In [5]:
df_gini.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2015,2016,2017,2018,2019,2020,2021,2022,2023,2024
0,Aruba,ABW,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Afghanistan,AFG,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Africa Western and Central,AFW,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Angola,AGO,Gini index,SI.POV.GINI,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,51.3,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df_pop.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1995,1996,1997,1998,1999,2000,...,2055,2060,2065,2070,2075,2080,2085,2090,2095,2100
0,Aruba,ABW,"Population, total",SP.POP.TOTL,80324.0,83200.0,85451.0,87277.0,89005.0,90853.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,18110657.0,18853437.0,19357126.0,19737765.0,20170844.0,20779953.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,13945206.0,14400719.0,14871570.0,15359601.0,15866869.0,16395473.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Anguilla,AIA,"Population, total",SP.POP.TOTL,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Albania,ALB,"Population, total",SP.POP.TOTL,3187784.0,3168033.0,3148281.0,3128530.0,3108778.0,3089027.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

##### 2. Convierta a formato *tidy* cada conjunto de datos. Realice esta labor por separado.

In [7]:
# Tu código aquí

###### Solución

In [8]:
# SOLUCIÓN 2
df_pibt = df_pib.melt(id_vars=['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code'], 
            value_name='PIB',
            var_name='Year')
df_ginit = df_gini.melt(id_vars=['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code'], 
            value_name='Gini index',
            var_name='Year')
df_popt = df_pop.melt(id_vars=['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code'], 
            value_name='Population',
            var_name='Year')

In [9]:
df_pibt

,Country Name,Country Code,Indicator Name,Indicator Code,Year,PIB
0,Aruba,ABW,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN
1,Africa Eastern and Southern,AFE,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,186.132432
2,Afghanistan,AFG,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN
3,Africa Western and Central,AFW,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,121.938353
4,Angola,AGO,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN
...,...,...,...,...,...,...
17285,Kosovo,XKX,GDP per capita (current US$),NY.GDP.PCAP.CD,2024,NaN
17286,"Yemen, Rep.",YEM,GDP per capita (current US$),NY.GDP.PCAP.CD,2024,NaN
17287,South Africa,ZAF,GDP per capita (current US$),NY.GDP.PCAP.CD,2024,NaN
17288,Zambia,ZMB,GDP per capita (current US$),NY.GDP.PCAP.CD,2024,NaN
17289,Zimbabwe,ZWE,GDP per capita (current US$),NY.GDP.PCAP.CD,2024,NaN

In [10]:
df_ginit.head()

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Gini index
0,Aruba,ABW,Gini index,SI.POV.GINI,1960,NaN
1,Africa Eastern and Southern,AFE,Gini index,SI.POV.GINI,1960,NaN
2,Afghanistan,AFG,Gini index,SI.POV.GINI,1960,NaN
3,Africa Western and Central,AFW,Gini index,SI.POV.GINI,1960,NaN
4,Angola,AGO,Gini index,SI.POV.GINI,1960,NaN

In [11]:
df_popt.head()

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
0,Aruba,ABW,"Population, total",SP.POP.TOTL,1995,80324.0
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1995,18110657.0
2,Angola,AGO,"Population, total",SP.POP.TOTL,1995,13945206.0
3,Anguilla,AIA,"Population, total",SP.POP.TOTL,1995,NaN
4,Albania,ALB,"Population, total",SP.POP.TOTL,1995,3187784.0

##### 3. Calcule la media y mediana de población anualmente.

In [12]:
# Tu código aquí

###### Solución

In [13]:
# SOLUCIÓN 3
# Promedio
df_popt.groupby('Year').agg({'Population':'mean'})

        Population
Year
1995  1.625435e+08
1996  1.649784e+08
1997  1.674075e+08
1998  1.684142e+08
1999  1.707680e+08
...            ...
2080           NaN
2085           NaN
2090           NaN
2095           NaN
2100           NaN

[66 rows x 1 columns]

In [14]:
# SOLUCIÓN 3
# Mediana
df_popt.groupby('Year').agg({'Population':'median'})

      Population
Year
1995   5836495.0
1996   6013107.0
1997   6122130.0
1998   6185562.0
1999   6362201.0
...          ...
2080         NaN
2085         NaN
2090         NaN
2095         NaN
2100         NaN

[66 rows x 1 columns]

##### 4. ¿Cómo se obtiene el país con mayor población?

In [15]:
# Tu código aquí

###### Solución

In [17]:
# SOLUCIÓN 4
df_popt.sort_values('Population', ascending=False).head()
# Hay agrupaciones de países!

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
6793,World,WLD,"Population, total",SP.POP.TOTL,2019,7.674533e+09
6521,World,WLD,"Population, total",SP.POP.TOTL,2018,7.594270e+09
6249,World,WLD,"Population, total",SP.POP.TOTL,2017,7.510990e+09
5977,World,WLD,"Population, total",SP.POP.TOTL,2016,7.426103e+09
5705,World,WLD,"Population, total",SP.POP.TOTL,2015,7.340548e+09

In [18]:
# SOLUCIÓN 4
# Encontrando nombres de países
most_population = df_popt.groupby('Country Name').agg({'Population':'sum'}).sort_values(by='Population',ascending=False).head(10)
most_population

                                               Population
Country Name
World                                        1.670961e+11
Low & middle income                          1.388135e+11
Middle income                                1.253264e+11
Lower middle income                          6.419621e+10
Upper middle income                          6.113018e+10
East Asia & Pacific                          5.390168e+10
East Asia & Pacific (excluding high income)  4.796666e+10
South Asia                                   3.899830e+10
China                                        3.281554e+10
India                                        2.940463e+10

In [24]:
# SOLUCIÓN 4
# Excluyendo Grupos
excluded = most_population[:8].index.to_list()
print('Se excluyen:', excluded)
# Filtrando df
df_popt_filtrado = df_popt[~df_popt['Country Name'].isin(excluded)]
df_popt_filtrado

Se excluyen: ['World', 'Low & middle income', 'Middle income', 'Lower middle income', 'Upper middle income', 'East Asia & Pacific', 'East Asia & Pacific (excluding high income)', 'South Asia']

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
0,Aruba,ABW,"Population, total",SP.POP.TOTL,1995,80324.0
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,1995,18110657.0
2,Angola,AGO,"Population, total",SP.POP.TOTL,1995,13945206.0
3,Anguilla,AIA,"Population, total",SP.POP.TOTL,1995,NaN
4,Albania,ALB,"Population, total",SP.POP.TOTL,1995,3187784.0
...,...,...,...,...,...,...
17947,Kosovo,XKX,"Population, total",SP.POP.TOTL,2100,NaN
17948,"Yemen, Rep.",YEM,"Population, total",SP.POP.TOTL,2100,NaN
17949,South Africa,ZAF,"Population, total",SP.POP.TOTL,2100,NaN
17950,Zambia,ZMB,"Population, total",SP.POP.TOTL,2100,NaN
17951,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,2100,NaN

In [25]:
# SOLUCIÓN 4
# Encontrando mayores
df_mayores_poblaciones = df_popt_filtrado.sort_values(by='Population', ascending=False).head()
df_mayores_poblaciones

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Population
6568,China,CHN,"Population, total",SP.POP.TOTL,2019,1.397295e+09
6296,China,CHN,"Population, total",SP.POP.TOTL,2018,1.392730e+09
6024,China,CHN,"Population, total",SP.POP.TOTL,2017,1.386395e+09
5752,China,CHN,"Population, total",SP.POP.TOTL,2016,1.378665e+09
5480,China,CHN,"Population, total",SP.POP.TOTL,2015,1.371220e+09

In [35]:
# SOLUCIÓN 4
# Resultado
mayor_poblacion = df_mayores_poblaciones.iloc[0]
print(f'El país con mayor población es {mayor_poblacion['Country Name']} el año {mayor_poblacion['Year']} con {int(mayor_poblacion['Population']):,} habitantes.')

El país con mayor población es China el año 2019 con 1,397,295,000 habitantes.

##### 5. ¿Cómo se obtiene el país con menor desigualdad?

In [36]:
# Tu código aquí

###### Solución

___Datito:___
_El índice de Gini, también conocido como coeficiente de Gini, es una medida de la desigualdad económica de una sociedad. Es la herramienta más común para medir la desigualdad de ingresos._

_Se expresa como un número entre 0 y 1, donde 0 indica igualdad perfecta y 1 indica desigualdad máxima._

In [37]:
# SOLUCIÓN 5
# Primera observación
df_ginit.sort_values(by='Gini index')
# No se necesita más pasos

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Gini index
8566,Czechia,CZE,Gini index,SI.POV.GINI,1992,20.7
7257,Finland,FIN,Gini index,SI.POV.GINI,1987,22.2
8321,Finland,FIN,Gini index,SI.POV.GINI,1991,22.9
5809,Sweden,SWE,Gini index,SI.POV.GINI,1981,22.9
9368,Denmark,DNK,Gini index,SI.POV.GINI,1995,23.0
...,...,...,...,...,...,...
17285,Kosovo,XKX,Gini index,SI.POV.GINI,2024,NaN
17286,"Yemen, Rep.",YEM,Gini index,SI.POV.GINI,2024,NaN
17287,South Africa,ZAF,Gini index,SI.POV.GINI,2024,NaN
17288,Zambia,ZMB,Gini index,SI.POV.GINI,2024,NaN
17289,Zimbabwe,ZWE,Gini index,SI.POV.GINI,2024,NaN

In [38]:
# SOLUCIÓN 5
# Respuesta
menor_desigualdad = df_ginit.sort_values(by='Gini index').iloc[0]
print(f'El país con menor desigualdad es {menor_desigualdad['Country Name']} el año {menor_desigualdad['Year']} con un índice de Gini de {menor_desigualdad['Gini index']}.')

El país con menor desigualdad es Czechia el año 1992 con un índice de Gini de 20.7.

In [39]:
df_ginit[df_ginit['Year'] == '2023'].sort_values(by='Gini index').head()

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Gini index
16864,Indonesia,IDN,Gini index,SI.POV.GINI,2023,36.1
16824,Ecuador,ECU,Gini index,SI.POV.GINI,2023,44.6
16806,Costa Rica,CRI,Gini index,SI.POV.GINI,2023,46.7
16943,Panama,PAN,Gini index,SI.POV.GINI,2023,48.9
16758,Aruba,ABW,Gini index,SI.POV.GINI,2023,NaN

##### 6. Calcule el promedio (media móvil) de PIB Per Cápita por país de los últimos 5 años.

###### Solución

___Datito:___ _La media móvil es un indicador técnico que calcula el promedio de precios de un período determinado._

_Se utiliza para suavizar los datos de precios y analizar tendencias._

_Usos: Determinar la dirección futura del mercado, Identificar tendencias predominantes, Detectar sobrecompra o sobreventa, Operar con rebotes, Incluir en sistemas de trading automáticos o semiautomáticos, etc._ 

_Cálculo:_ 
$[ \text{Media móvil} = \frac{x_t + x_{t-1} + \dots + x_{t-(N-1)}}{N} ]$

Donde:
- $x_t$ es el valor actual en la serie de datos.
- $ N $ es el tamaño de la ventana (cantidad de períodos que se promedian).
- Se suman los últimos $ N $ valores y se dividen entre $ N $ para obtener la media móvil.

In [40]:
# SOLUCIÓN 6
# Este cálculo se automatiza en pandas
df_pibt['MMovil'] = df_pibt.groupby('Country Name')['PIB'].rolling(window=5, min_periods=1).mean().reset_index(level=0, drop=True)
df_pibt[df_pibt['Year']=='2023'][['Country Name','MMovil']] # Sólo para 2023

                      Country Name        MMovil
16758                        Aruba  29139.304526
16759  Africa Eastern and Southern   1529.598262
16760                  Afghanistan    427.370870
16761   Africa Western and Central   1708.340683
16762                       Angola   2160.701493
...                            ...           ...
17019                       Kosovo   5049.683558
17020                  Yemen, Rep.    559.645092
17021                 South Africa   6300.733596
17022                       Zambia   1223.128440
17023                     Zimbabwe   1867.083118

[266 rows x 2 columns]

##### 7. Concatene ambos conjuntos de datos en un único DataFrame. Use `.concat()`.

In [341]:
# Tu código aquí

###### Solución

In [41]:
# SOLUCIÓN 7
# Concatenación simple
df_concat = pd.concat([df_pibt, df_popt, df_ginit])
df_concat

,Country Name,Country Code,Indicator Name,Indicator Code,Year,PIB,MMovil,Population,Gini index
0,Aruba,ABW,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN,NaN,NaN,NaN
1,Africa Eastern and Southern,AFE,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,186.132432,186.132432,NaN,NaN
2,Afghanistan,AFG,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN,NaN,NaN,NaN
3,Africa Western and Central,AFW,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,121.938353,121.938353,NaN,NaN
4,Angola,AGO,GDP per capita (current US$),NY.GDP.PCAP.CD,1960,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
17285,Kosovo,XKX,Gini index,SI.POV.GINI,2024,NaN,NaN,NaN,NaN
17286,"Yemen, Rep.",YEM,Gini index,SI.POV.GINI,2024,NaN,NaN,NaN,NaN
17287,South Africa,ZAF,Gini index,SI.POV.GINI,2024,NaN,NaN,NaN,NaN
17288,Zambia,ZMB,Gini index,SI.POV.GINI,2024,NaN,NaN,NaN,NaN
17289,Zimbabwe,ZWE,Gini index,SI.POV.GINI,2024,NaN,NaN,NaN,NaN

##### 8. Combine ambos conjuntos de datos en un único DataFrame. Use `.merge()`.

In [343]:
# Tu código aquí

###### Solución

In [42]:
# SOLUCIÓN 7
# Concatenación simple
df_merged = pd.merge(df_pibt, df_popt, on=['Country Name', 'Country Code', 'Year'])
df_merged = pd.merge(df_merged, df_ginit, on=['Country Name', 'Country Code', 'Year'])
df_merged.head()

,Country Name,Country Code,Indicator Name_x,Indicator Code_x,Year,PIB,MMovil,Indicator Name_y,Indicator Code_y,Population,Indicator Name,Indicator Code,Gini index
0,Aruba,ABW,GDP per capita (current US$),NY.GDP.PCAP.CD,1995,16548.717387,14886.312128,"Population, total",SP.POP.TOTL,80324.0,Gini index,SI.POV.GINI,NaN
1,Afghanistan,AFG,GDP per capita (current US$),NY.GDP.PCAP.CD,1995,NaN,NaN,"Population, total",SP.POP.TOTL,18110657.0,Gini index,SI.POV.GINI,NaN
2,Angola,AGO,GDP per capita (current US$),NY.GDP.PCAP.CD,1995,404.294818,547.924362,"Population, total",SP.POP.TOTL,13945206.0,Gini index,SI.POV.GINI,NaN
3,Albania,ALB,GDP per capita (current US$),NY.GDP.PCAP.CD,1995,750.604449,448.347805,"Population, total",SP.POP.TOTL,3187784.0,Gini index,SI.POV.GINI,NaN
4,Andorra,AND,GDP per capita (current US$),NY.GDP.PCAP.CD,1995,18443.254520,17948.284415,"Population, total",SP.POP.TOTL,63850.0,Gini index,SI.POV.GINI,NaN

##### 9. Luego de realizar los ejercicios anteriores, ¿Cuáles son las ventajas y desventajas de usar `concat` y `merge`?

Tu respuesta aquí:

##### 10. Calcule los países que tuvieron mayor variación en su índice de Gini.

In [345]:
# Tu código aquí

###### Solución

##### 11. A partir del PIB Per Cápita y la Población, obtenga una nueva columna para medir el PIB.

In [395]:
# Tu código aquí

###### Solución

In [43]:
# SOLUCIÓN 11
# Filtro de columnas (solo para mejor visualización)
column_list = [column for column in df_merged.columns 
               if 
               ('Indicator Name' not in column)
                and
               ('Indicator Code' not in column)
               ]
column_list

['Country Name',
 'Country Code',
 'Year',
 'PIB',
 'MMovil',
 'Population',
 'Gini index']

In [44]:
# SOLUCIÓN 11
# Filtro de columnas aplicado
df_merged_clean = df_merged[column_list]
df_merged_clean = df_merged_clean.rename(columns={'PIB':'PIBPC'}) # Mala mia, tenia PIB per capita como PIB, asi que lo renombro
df_merged_clean

,Country Name,Country Code,Year,PIBPC,MMovil,Population,Gini index
0,Aruba,ABW,1995,16548.717387,14886.312128,80324.0,NaN
1,Afghanistan,AFG,1995,NaN,NaN,18110657.0,NaN
2,Angola,AGO,1995,404.294818,547.924362,13945206.0,NaN
3,Albania,ALB,1995,750.604449,448.347805,3187784.0,NaN
4,Andorra,AND,1995,18443.254520,17948.284415,63850.0,NaN
...,...,...,...,...,...,...,...
7885,Kosovo,XKX,2024,NaN,5208.105157,NaN,NaN
7886,"Yemen, Rep.",YEM,2024,NaN,543.712323,NaN,NaN
7887,South Africa,ZAF,2024,NaN,6242.489192,NaN,NaN
7888,Zambia,ZMB,2024,NaN,1214.164001,NaN,NaN
7889,Zimbabwe,ZWE,2024,NaN,1912.846921,NaN,NaN

In [402]:
# SOLUCIÓN 11
# Cálculo de PIB
df_merged_clean['PIB'] = df_merged_clean['PIBPC'] * df_merged_clean['Population']
df_merged_clean

,Country Name,Country Code,Year,PIBPC,MMovil,Population,Gini index,Tasa Crecimiento,PIB
0,Aruba,ABW,1995,16548.717387,14886.312128,80324.0,NaN,NaN,1.329259e+09
1,Afghanistan,AFG,1995,NaN,NaN,18110657.0,NaN,NaN,NaN
2,Angola,AGO,1995,404.294818,547.924362,13945206.0,NaN,NaN,5.637975e+09
3,Albania,ALB,1995,750.604449,448.347805,3187784.0,NaN,NaN,2.392765e+09
4,Andorra,AND,1995,18443.254520,17948.284415,63850.0,NaN,NaN,1.177602e+09
...,...,...,...,...,...,...,...,...,...
7885,Kosovo,XKX,2024,NaN,5208.105157,NaN,NaN,NaN,NaN
7886,"Yemen, Rep.",YEM,2024,NaN,543.712323,NaN,NaN,NaN,NaN
7887,South Africa,ZAF,2024,NaN,6242.489192,NaN,NaN,NaN,NaN
7888,Zambia,ZMB,2024,NaN,1214.164001,NaN,NaN,NaN,NaN
7889,Zimbabwe,ZWE,2024,NaN,1912.846921,NaN,NaN,NaN,NaN

##### 12. Calcule la tasa de crecimiento poblacional anual por país como una nueva columna de datos.

In [403]:
# Tu código aquí

###### Solución

In [404]:
# SOLUCIÓN 12
# Denuevo pandas nos salva la vida
df_merged_clean['Tasa Crecimiento'] = df_merged_clean.groupby(['Country Name','Country Code'])['Population'].pct_change(fill_method=None)
df_merged_clean[df_merged_clean['Country Name'] == 'Chile']

,Country Name,Country Code,Year,PIBPC,MMovil,Population,Gini index,Tasa Crecimiento,PIB
37,Chile,CHL,1995,5055.614062,3722.295549,14380866.0,NaN,NaN,7.270411e+10
300,Chile,CHL,1996,5333.504387,4234.980497,14587370.0,54.9,0.014360,7.780180e+10
563,Chile,CHL,1997,5741.958430,4721.492336,14786220.0,NaN,0.013632,8.490186e+10
826,Chile,CHL,1998,5419.824173,5106.458248,14977733.0,55.5,0.012952,8.117668e+10
1089,Chile,CHL,1999,4933.555815,5296.891374,15162800.0,NaN,0.012356,7.480652e+10
1352,Chile,CHL,2000,5052.992458,5296.367053,15342353.0,52.8,0.011842,7.752479e+10
1615,Chile,CHL,2001,4563.595299,5142.385235,15516113.0,NaN,0.011326,7.080926e+10
1878,Chile,CHL,2002,4430.847412,4880.163031,15684409.0,NaN,0.010847,6.949522e+10
2141,Chile,CHL,2003,4773.401775,4750.878552,15849652.0,51.5,0.010535,7.565676e+10
2404,Chile,CHL,2004,6120.591521,4988.285693,16014971.0,NaN,0.010430,9.802110e+10
2667,Chile,CHL,2005,7480.323310,5473.751863,16182721.0,NaN,0.010475,1.210520e+11
2930,Chile,CHL,2006,9318.656553,6424.764114,16354504.0,47.7,0.010615,1.524020e+11
3193,Chile,CHL,2007,10346.413818,7607.877395,16530195.0,NaN,0.010743,1.710282e+11
3456,Chile,CHL,2008,10683.218877,8789.840816,16708258.0,NaN,0.010772,1.784980e+11
3719,Chile,CHL,2009,10098.801717,9585.482855,16886186.0,47.4,0.010649,1.705302e+11
3982,Chile,CHL,2010,12632.870473,10615.992288,17062536.0,NaN,0.010443,2.155488e+11
4245,Chile,CHL,2011,14487.392783,11649.739534,17233576.0,46.9,0.010024,2.496696e+11
4508,Chile,CHL,2012,15241.906998,12628.838169,17400347.0,NaN,0.009677,2.652145e+11
4771,Chile,CHL,2013,15683.548637,13628.904121,17571507.0,46.8,0.009837,2.755836e+11
5034,Chile,CHL,2014,14529.676721,14515.079122,17758959.0,NaN,0.010668,2.580319e+11
5297,Chile,CHL,2015,13433.920299,14675.289087,17969353.0,45.3,0.011847,2.413989e+11
5560,Chile,CHL,2016,13649.852046,14507.780940,18209068.0,NaN,0.013340,2.485511e+11
5823,Chile,CHL,2017,14879.908623,14435.381265,18470439.0,45.3,0.014354,2.748384e+11
6086,Chile,CHL,2018,15659.480868,14430.567711,18729160.0,NaN,0.014007,2.932889e+11
6349,Chile,CHL,2019,14495.716722,14423.775711,18952000.0,NaN,0.011898,2.747228e+11
6612,Chile,CHL,2020,13114.815471,14359.954746,NaN,47.0,NaN,NaN
6875,Chile,CHL,2021,16216.570647,14873.298466,NaN,NaN,NaN,NaN
7138,Chile,CHL,2022,15451.131958,14987.543133,NaN,43.0,NaN,NaN
7401,Chile,CHL,2023,17067.813615,15269.209682,NaN,NaN,NaN,NaN
7664,Chile,CHL,2024,NaN,15462.582923,NaN,NaN,NaN,NaN

In [405]:
# SOLUCIÓN 12
# Alternativa 2 - A mano
df_merged_clean['Tasa Crecimiento'] = (df_merged_clean['Population'] - df_merged_clean.groupby(['Country Name','Country Code'])['Population'].shift(1))/ df_merged_clean.groupby(['Country Name','Country Code'])['Population'].shift(1)

df_merged_clean[df_merged_clean['Country Name'] == 'Chile']

,Country Name,Country Code,Year,PIBPC,MMovil,Population,Gini index,Tasa Crecimiento,PIB
37,Chile,CHL,1995,5055.614062,3722.295549,14380866.0,NaN,NaN,7.270411e+10
300,Chile,CHL,1996,5333.504387,4234.980497,14587370.0,54.9,0.014360,7.780180e+10
563,Chile,CHL,1997,5741.958430,4721.492336,14786220.0,NaN,0.013632,8.490186e+10
826,Chile,CHL,1998,5419.824173,5106.458248,14977733.0,55.5,0.012952,8.117668e+10
1089,Chile,CHL,1999,4933.555815,5296.891374,15162800.0,NaN,0.012356,7.480652e+10
1352,Chile,CHL,2000,5052.992458,5296.367053,15342353.0,52.8,0.011842,7.752479e+10
1615,Chile,CHL,2001,4563.595299,5142.385235,15516113.0,NaN,0.011326,7.080926e+10
1878,Chile,CHL,2002,4430.847412,4880.163031,15684409.0,NaN,0.010847,6.949522e+10
2141,Chile,CHL,2003,4773.401775,4750.878552,15849652.0,51.5,0.010535,7.565676e+10
2404,Chile,CHL,2004,6120.591521,4988.285693,16014971.0,NaN,0.010430,9.802110e+10
2667,Chile,CHL,2005,7480.323310,5473.751863,16182721.0,NaN,0.010475,1.210520e+11
2930,Chile,CHL,2006,9318.656553,6424.764114,16354504.0,47.7,0.010615,1.524020e+11
3193,Chile,CHL,2007,10346.413818,7607.877395,16530195.0,NaN,0.010743,1.710282e+11
3456,Chile,CHL,2008,10683.218877,8789.840816,16708258.0,NaN,0.010772,1.784980e+11
3719,Chile,CHL,2009,10098.801717,9585.482855,16886186.0,47.4,0.010649,1.705302e+11
3982,Chile,CHL,2010,12632.870473,10615.992288,17062536.0,NaN,0.010443,2.155488e+11
4245,Chile,CHL,2011,14487.392783,11649.739534,17233576.0,46.9,0.010024,2.496696e+11
4508,Chile,CHL,2012,15241.906998,12628.838169,17400347.0,NaN,0.009677,2.652145e+11
4771,Chile,CHL,2013,15683.548637,13628.904121,17571507.0,46.8,0.009837,2.755836e+11
5034,Chile,CHL,2014,14529.676721,14515.079122,17758959.0,NaN,0.010668,2.580319e+11
5297,Chile,CHL,2015,13433.920299,14675.289087,17969353.0,45.3,0.011847,2.413989e+11
5560,Chile,CHL,2016,13649.852046,14507.780940,18209068.0,NaN,0.013340,2.485511e+11
5823,Chile,CHL,2017,14879.908623,14435.381265,18470439.0,45.3,0.014354,2.748384e+11
6086,Chile,CHL,2018,15659.480868,14430.567711,18729160.0,NaN,0.014007,2.932889e+11
6349,Chile,CHL,2019,14495.716722,14423.775711,18952000.0,NaN,0.011898,2.747228e+11
6612,Chile,CHL,2020,13114.815471,14359.954746,NaN,47.0,NaN,NaN
6875,Chile,CHL,2021,16216.570647,14873.298466,NaN,NaN,NaN,NaN
7138,Chile,CHL,2022,15451.131958,14987.543133,NaN,43.0,NaN,NaN
7401,Chile,CHL,2023,17067.813615,15269.209682,NaN,NaN,NaN,NaN
7664,Chile,CHL,2024,NaN,15462.582923,NaN,NaN,NaN,NaN

##### 13. ¿Cuál es la tasa de crecimiento poblacional anual para Chile y Argentina?

In [406]:
# Tu código aquí

###### Solución

In [407]:
# SOUCIÓN 13
# Obtención
df_tasa_chileyarg = df_merged_clean[df_merged_clean['Country Name'].isin(['Chile','Argentina'])][['Country Name','Year','Tasa Crecimiento']].sort_values(by=['Country Name','Year'])
df_tasa_chileyarg

     Country Name  Year  Tasa Crecimiento
7       Argentina  1995               NaN
270     Argentina  1996          0.012008
533     Argentina  1997          0.011662
796     Argentina  1998          0.011387
1059    Argentina  1999          0.011196
1322    Argentina  2000          0.011067
1585    Argentina  2001          0.010981
1848    Argentina  2002          0.010894
2111    Argentina  2003          0.010778
2374    Argentina  2004          0.010610
2637    Argentina  2005          0.010417
2900    Argentina  2006          0.010206
3163    Argentina  2007          0.010039
3426    Argentina  2008          0.009975
3689    Argentina  2009          0.010046
3952    Argentina  2010          0.007550
4215    Argentina  2011          0.011597
4478    Argentina  2012          0.011434
4741    Argentina  2013          0.011254
5004    Argentina  2014          0.011055
5267    Argentina  2015          0.010838
5530    Argentina  2016          0.010628
5793    Argentina  2017          0.010425
6056    Argentina  2018          0.010210
6319    Argentina  2019          0.009136
6582    Argentina  2020               NaN
6845    Argentina  2021               NaN
7108    Argentina  2022               NaN
7371    Argentina  2023               NaN
7634    Argentina  2024               NaN
37          Chile  1995               NaN
300         Chile  1996          0.014360
563         Chile  1997          0.013632
826         Chile  1998          0.012952
1089        Chile  1999          0.012356
1352        Chile  2000          0.011842
1615        Chile  2001          0.011326
1878        Chile  2002          0.010847
2141        Chile  2003          0.010535
2404        Chile  2004          0.010430
2667        Chile  2005          0.010475
2930        Chile  2006          0.010615
3193        Chile  2007          0.010743
3456        Chile  2008          0.010772
3719        Chile  2009          0.010649
3982        Chile  2010          0.010443
4245        Chile  2011          0.010024
4508        Chile  2012          0.009677
4771        Chile  2013          0.009837
5034        Chile  2014          0.010668
5297        Chile  2015          0.011847
5560        Chile  2016          0.013340
5823        Chile  2017          0.014354
6086        Chile  2018          0.014007
6349        Chile  2019          0.011898
6612        Chile  2020               NaN
6875        Chile  2021               NaN
7138        Chile  2022               NaN
7401        Chile  2023               NaN
7664        Chile  2024               NaN

In [408]:
# SOUCIÓN 13
# Creación de Tabla Mejor
df_tasa_chileyarg['Tasa Porcentual'] = df_tasa_chileyarg['Tasa Crecimiento'].dropna().apply(lambda x: f"{x*100:.2f}%")
tabla_crecimiento = df_tasa_chileyarg.pivot(index='Year',columns='Country Name', values='Tasa Porcentual').dropna()
tabla_crecimiento

Country Name Argentina  Chile
Year
1996             1.20%  1.44%
1997             1.17%  1.36%
1998             1.14%  1.30%
1999             1.12%  1.24%
2000             1.11%  1.18%
2001             1.10%  1.13%
2002             1.09%  1.08%
2003             1.08%  1.05%
2004             1.06%  1.04%
2005             1.04%  1.05%
2006             1.02%  1.06%
2007             1.00%  1.07%
2008             1.00%  1.08%
2009             1.00%  1.06%
2010             0.76%  1.04%
2011             1.16%  1.00%
2012             1.14%  0.97%
2013             1.13%  0.98%
2014             1.11%  1.07%
2015             1.08%  1.18%
2016             1.06%  1.33%
2017             1.04%  1.44%
2018             1.02%  1.40%
2019             0.91%  1.19%

##### 14. Al año 2000, determine cuáles son los 10 países con mayor PIB Per Cápita y los 10 con mayor población. ¿Son los mismos países al 2020?

In [409]:
# Tu código aquí

###### Solución

In [412]:
# SOLUCIÓN 14
# Filtro de año
filtro_año_2000 = df_merged_clean['Year'] == '2000'
filtro_año_2020 = df_merged_clean['Year'] == '2020'
df_2000 = df_merged_clean[filtro_año_2000]
df_2020 = df_merged_clean[filtro_año_2020]

In [413]:
# SOLUCIÓN 14
# 10 con más pop el 2000
wanted_columns = ['Country Name', 'Year', 'PIBPC']
top_10_pibpc_2000 = df_2000.sort_values(by='PIBPC',ascending=False).head(10)[wanted_columns].reset_index(drop=True)
top_10_pibpc_2000

      Country Name  Year         PIBPC
0           Monaco  2000  81789.020652
1    Liechtenstein  2000  76087.911114
2          Bermuda  2000  56542.956946
3       Luxembourg  2000  48659.598875
4  Channel Islands  2000  43479.194077
5            Japan  2000  39169.359570
6      Switzerland  2000  38865.021940
7           Norway  2000  38178.236878
8       San Marino  2000  37600.707738
9    United States  2000  36329.970260

In [415]:
# SOLUCIÓN 14
# 10 con más PIBPC el 2020
top_10_pibpc_2020 = df_2020.sort_values(by='PIBPC',ascending=False).head(10)[wanted_columns].reset_index(drop=True)
top_10_pibpc_2020

     Country Name  Year          PIBPC
0          Monaco  2020  176891.886538
1   Liechtenstein  2020  164671.093553
2      Luxembourg  2020  116905.370397
3         Bermuda  2020  106973.175732
4         Ireland  2020   87567.114897
5     Switzerland  2020   85897.784334
6  Cayman Islands  2020   82338.798285
7     Isle of Man  2020   79513.533035
8          Norway  2020   68340.018103
9   United States  2020   64411.373178

In [416]:
# SOLUCIÓN 14
# Tabla Comparativa
tabla_top_10_pibpc = pd.DataFrame({'Top 2000': top_10_pibpc_2000['Country Name'], 
                                   'PIBPC 2000': top_10_pibpc_2000['PIBPC'],
                                   'Top 2020': top_10_pibpc_2020['Country Name'], 
                                   'PIBPC 2020': top_10_pibpc_2020['PIBPC']})
tabla_top_10_pibpc

          Top 2000    PIBPC 2000        Top 2020     PIBPC 2020
0           Monaco  81789.020652          Monaco  176891.886538
1    Liechtenstein  76087.911114   Liechtenstein  164671.093553
2          Bermuda  56542.956946      Luxembourg  116905.370397
3       Luxembourg  48659.598875         Bermuda  106973.175732
4  Channel Islands  43479.194077         Ireland   87567.114897
5            Japan  39169.359570     Switzerland   85897.784334
6      Switzerland  38865.021940  Cayman Islands   82338.798285
7           Norway  38178.236878     Isle of Man   79513.533035
8       San Marino  37600.707738          Norway   68340.018103
9    United States  36329.970260   United States   64411.373178

In [417]:
# SOLUCIÓN 14
# Ejemplo completo para población

# 10 con más Population el 2000
wanted_columns = ['Country Name', 'Year', 'Population']
top_10_pop_2000 = df_2000[~df_2000['Country Name'].isin(excluded)].sort_values(by='Population',ascending=False).head(10)[wanted_columns].reset_index(drop=True)
top_10_pop_2020 = df_2020[~df_2020['Country Name'].isin(excluded)].sort_values(by='Population',ascending=False).head(10)[wanted_columns].reset_index(drop=True)

# Tabla Comparativa
tabla_top_10_pop = pd.DataFrame({'Top 2000': top_10_pop_2000['Country Name'], 
                                   'Population 2000': top_10_pop_2000['Population'],
                                   'Top 2020': top_10_pop_2020['Country Name'], 
                                   'Population 2020': top_10_pop_2020['Population']})
tabla_top_10_pop

,Top 2000,Population 2000,Top 2020,Population 2020
0,China,1.262645e+09,Aruba,NaN
1,OECD members,1.156314e+09,Afghanistan,NaN
2,High income,1.077840e+09,Angola,NaN
3,India,1.056576e+09,Albania,NaN
4,Europe & Central Asia,8.619934e+08,Andorra,NaN
5,Sub-Saharan Africa,6.653276e+08,Arab World,NaN
6,Sub-Saharan Africa (excluding high income),6.652464e+08,United Arab Emirates,NaN
7,Least developed countries: UN classification,6.572159e+08,Argentina,NaN
8,Latin America & Caribbean,5.209644e+08,Armenia,NaN
9,Latin America & Caribbean (excluding high income),4.930290e+08,American Samoa,NaN

##### 15. Al año 2020, ¿Cuáles son los países con mayor nivel de desigualdad, y que, al mismo tiempo, tengan una población menor a 40 millones de habitantes?

In [ ]:
# Tu código aquí

###### Solución

In [438]:
df_popt[df_popt['Year'] == '2020'].dropna()

Empty DataFrame
Columns: [Country Name, Country Code, Indicator Name, Indicator Code, Year, Population]
Index: []

In [443]:
df_2020 = df_merged_clean[df_merged_clean['Year']=='2019']
df_2020[df_2020['Population']>40*10**6].sort_values(by='Gini index', ascending=False).head()

,Country Name,Country Code,Year,PIBPC,MMovil,Population,Gini index,Tasa Crecimiento,PIB
6339,Brazil,BRA,2019,9029.833267,9236.697469,211050000.0,53.5,0.007546,1.905746e+12
6355,Colombia,COL,2019,6472.545449,6395.480671,50339000.0,51.3,0.013904,3.258215e+11
6553,Turkiye,TUR,2019,9215.440499,10299.973353,83430000.0,43.8,0.013487,7.688442e+11
6319,Argentina,ARG,2019,9955.974787,12524.172884,44901000.0,43.3,0.009136,4.470332e+11
6556,Uganda,UGA,2019,822.057058,799.014455,44270000.0,42.7,0.036207,3.639247e+10